src/cf/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеСведения</name>
  <comment>Значения дополнительных сведений (реквизиты с флагом ЭтоСведение) по объектам; пишет УправлениеСвойствами</comment>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ДополнительныеРеквизиты</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизиты/ДополнительныеРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизиты</name>
  <comment>Механизм дополнительных реквизитов и сведений (общий модуль УправлениеСвойствами): реквизиты хранятся в ТЧ объекта, сведения - в регистре ДополнительныеСведения</comment>
  <type>
    <types>CatalogRef.ЗначенияДополнительныхРеквизитов</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Номенклатура</types>
    <types>String</types>
    <types>Date</types>
    <types>Boolean</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <attributes>
    <name>Набор</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обязательный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Многострочное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отрасль</name>
    <type>
      <types>EnumRef.Отрасли</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодсказкаПредставления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/cf/src/CommonModules/УправлениеСвойствами/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Дополнительные реквизиты и сведения объектов - собственная компактная версия
// механизма УНФ «Дополнительные реквизиты и сведения» (docs/UNF-ADOPTION.md).
//
// Описание реквизита - элемент ПВХ ДополнительныеРеквизиты: набор (объект метаданных),
// имя для программного доступа, тип, заголовки по языкам, обязательность, порядок.
//  - реквизит (ЭтоСведение = Ложь) хранится в табличной части ДополнительныеРеквизиты
//    самого объекта и записывается вместе с ним;
//  - сведение (ЭтоСведение = Истина) хранится в регистре ДополнительныеСведения
//    и не требует права на изменение объекта.
// Поля в форме объекта строятся программно в указанной группе: ЗаполнитьДополнительныеРеквизитыВФорме
// в ПриСозданииНаСервере, ПеренестиЗначенияИзФормыВОбъект в ПередЗаписьюНаСервере,
// ЗаписатьДополнительныеСведения в ПослеЗаписиНаСервере.
// Подключено к справочнику Номенклатура; для нового объекта нужны предопределённый набор
// в справочнике НаборыДополнительныхРеквизитов, ТЧ ДополнительныеРеквизиты (Свойство, Значение)
// и тип объекта в измерении регистра ДополнительныеСведения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Строит поля дополнительных реквизитов и сведений в форме объекта и заполняет их значениями.
//
// Параметры:
//  Форма      - ФормаКлиентскогоПриложения - форма объекта с основным реквизитом «Объект»
//  ИмяОбъекта - Строка - полное имя объекта метаданных, например "Справочник.Номенклатура"
//  ИмяГруппы  - Строка - имя группы формы, в которую добавляются поля
//
// Возвращаемое значение:
//  Число - сколько полей построено; 0 - у объекта нет дополнительных реквизитов
//
Функция ЗаполнитьДополнительныеРеквизитыВФорме(Форма, ИмяОбъекта, ИмяГруппы) Экспорт

	Свойства = СвойстваОбъекта(ИмяОбъекта, КодТекущегоЯзыка());

	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипСвойство = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизиты");
	Таблица = ИмяТаблицыОписаний();

	ДобавляемыеРеквизиты = Новый Массив;
	РеквизитТаблицы = Новый РеквизитФормы(Таблица, Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(РеквизитТаблицы);
	Колонка = Новый РеквизитФормы("ИмяРеквизита", ТипСтрока, Таблица);
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Свойство", ТипСвойство, Таблица);
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ЭтоСведение", ТипБулево, Таблица);
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Обязательный", ТипБулево, Таблица);
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Заголовок", ТипСтрока, Таблица);
	ДобавляемыеРеквизиты.Добавить(Колонка);

	Номер = 0;
	Для Каждого Свойство Из Свойства Цикл
		Номер = Номер + 1;
		Реквизит = Новый РеквизитФормы(ИмяРеквизитаФормы(Номер), Свойство.ТипЗначения, , Свойство.Заголовок);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
	КонецЦикла;
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	Значения = ЗначенияСвойствОбъекта(Форма.Объект, Свойства);
	Группа = Форма.Элементы[ИмяГруппы];
	Описания = Форма[ИмяТаблицыОписаний()];

	Номер = 0;
	Для Каждого Свойство Из Свойства Цикл
		Номер = Номер + 1;
		ИмяРеквизита = ИмяРеквизитаФормы(Номер);

		Описание = Описания.Добавить();
		Описание.ИмяРеквизита = ИмяРеквизита;
		Описание.Свойство = Свойство.Свойство;
		Описание.ЭтоСведение = Свойство.ЭтоСведение;
		Описание.Обязательный = Свойство.Обязательный;
		Описание.Заголовок = Свойство.Заголовок;

		ДобавитьПолеФормы(Форма, Группа, ИмяРеквизита, Свойство);

		Значение = Значения.Получить(Свойство.Свойство);
		Если Значение <> Неопределено Тогда
			Форма[ИмяРеквизита] = Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат Свойства.Количество();

КонецФункции

// Переносит значения полей дополнительных реквизитов из формы в табличную часть записываемого
// объекта и проверяет обязательные. Сведения (регистр) здесь не трогаются - их пишет
// ЗаписатьДополнительныеСведения после записи объекта.
//
// Параметры:
//  Форма         - ФормаКлиентскогоПриложения - форма после ЗаполнитьДополнительныеРеквизитыВФорме
//  ТекущийОбъект - СправочникОбъект - записываемый объект с ТЧ ДополнительныеРеквизиты
//  Отказ         - Булево - устанавливается, если не заполнен обязательный реквизит
//
Процедура ПеренестиЗначенияИзФормыВОбъект(Форма, ТекущийОбъект, Отказ) Экспорт

	Если Не ФормаСДополнительнымиРеквизитами(Форма) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Описание Из Форма[ИмяТаблицыОписаний()] Цикл
		Значение = Форма[Описание.ИмяРеквизита];
		Если Описание.Обязательный И Не ЗначениеЗаполнено(Значение) Тогда
			ШаблонСообщения = НСтр("ru = 'Не заполнен реквизит «%1»'; fr = 'L''attribut « %1 » n''est pas renseigné';
				|en = 'The attribute ""%1"" is not filled in'; es = 'El atributo «%1» no está completado'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Описание.Заголовок);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Описание.ИмяРеквизита, , Отказ);
		КонецЕсли;
		Если Описание.ЭтоСведение Тогда
			Продолжить;
		КонецЕсли;

		Строки = ТекущийОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Описание.Свойство));
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Для Каждого Строка Из Строки Цикл
				ТекущийОбъект.ДополнительныеРеквизиты.Удалить(Строка);
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		Если Строки.Количество() = 0 Тогда
			Строка = ТекущийОбъект.ДополнительныеРеквизиты.Добавить();
			Строка.Свойство = Описание.Свойство;
		Иначе
			Строка = Строки[0];
		КонецЕсли;
		Строка.Значение = Значение;
	КонецЦикла;

КонецПроцедуры

// Записывает значения дополнительных сведений из полей формы в регистр ДополнительныеСведения.
// Вызывается после записи объекта, когда ссылка уже есть.
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма после ЗаполнитьДополнительныеРеквизитыВФорме
//  Объект - ЛюбаяСсылка - записанный объект
//
Процедура ЗаписатьДополнительныеСведения(Форма, Объект) Экспорт

	Если Не ФормаСДополнительнымиРеквизитами(Форма) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Описание Из Форма[ИмяТаблицыОписаний()] Цикл
		Если Не Описание.ЭтоСведение Тогда
			Продолжить;
		КонецЕсли;
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		Запись.Объект = Объект;
		Запись.Свойство = Описание.Свойство;
		Значение = Форма[Описание.ИмяРеквизита];
		Если ЗначениеЗаполнено(Значение) Тогда
			Запись.Значение = Значение;
			Запись.Записать(Истина);
		Иначе
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Значение дополнительного реквизита или сведения объекта по имени реквизита.
//
// Параметры:
//  Объект       - ЛюбаяСсылка - объект с дополнительными реквизитами
//  ИмяРеквизита - Строка - реквизит Имя элемента ПВХ, например "Площадь"
//
// Возвращаемое значение:
//  Произвольный - значение; Неопределено, если реквизита нет или он не заполнен
//
Функция ЗначениеСвойства(Объект, ИмяРеквизита) Экспорт

	Свойство = НайтиСвойство(Объект.Метаданные().ПолноеИмя(), ИмяРеквизита);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Свойства = Новый ТаблицаЗначений;
	Свойства.Колонки.Добавить("Свойство");
	Свойства.Колонки.Добавить("ЭтоСведение");
	Строка = Свойства.Добавить();
	Строка.Свойство = Свойство;
	Строка.ЭтоСведение = Свойство.ЭтоСведение;

	Возврат ЗначенияСвойствОбъекта(Объект, Свойства).Получить(Свойство);

КонецФункции

// Шаблон параметров для ДобавитьСвойство().
//
// Возвращаемое значение:
//  Структура:
//   * ИмяОбъекта   - Строка - полное имя объекта метаданных, например "Справочник.Номенклатура"
//   * Имя          - Строка - имя для программного доступа; по нему свойство ищется повторно
//   * Наименование - Строка - наименование на основном языке
//   * Заголовки    - Соответствие - код языка -> заголовок; основной язык можно не указывать
//   * ТипЗначения  - ОписаниеТипов - тип значения
//   * Подсказка    - Строка
//   * Обязательный - Булево
//   * ЭтоСведение  - Булево - хранить в регистре, а не в объекте
//   * Порядок      - Число - порядок поля в форме
//   * Отрасль      - ПеречислениеСсылка.Отрасли - какой отраслью создано; пусто - вручную
//
Функция ПараметрыДобавленияСвойства() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("ИмяОбъекта", "");
	Параметры.Вставить("Имя", "");
	Параметры.Вставить("Наименование", "");
	Параметры.Вставить("Заголовки", Новый Соответствие);
	Параметры.Вставить("ТипЗначения", Новый ОписаниеТипов("Строка"));
	Параметры.Вставить("Подсказка", "");
	Параметры.Вставить("Обязательный", Ложь);
	Параметры.Вставить("ЭтоСведение", Ложь);
	Параметры.Вставить("Порядок", 0);
	Параметры.Вставить("Отрасль", Перечисления.Отрасли.ПустаяСсылка());
	Возврат Параметры;

КонецФункции

// Заводит дополнительный реквизит объекта. Повторный вызов с тем же ИмяОбъекта и Имя
// ничего не создаёт и возвращает существующий реквизит - так отраслевые наборы
// применяются идемпотентно.
//
// Параметры:
//  Параметры - Структура - см. ПараметрыДобавленияСвойства()
//
// Возвращаемое значение:
//  ПланВидовХарактеристикСсылка.ДополнительныеРеквизиты
//
Функция ДобавитьСвойство(Параметры) Экспорт

	Свойство = НайтиСвойство(Параметры.ИмяОбъекта, Параметры.Имя);
	Если ЗначениеЗаполнено(Свойство) Тогда
		Возврат Свойство;
	КонецЕсли;

	Набор = НаборПоИмениОбъекта(Параметры.ИмяОбъекта);
	Если Не ЗначениеЗаполнено(Набор) Тогда
		ВызватьИсключение "Для объекта " + Параметры.ИмяОбъекта + " нет набора дополнительных реквизитов";
	КонецЕсли;

	Объект = ПланыВидовХарактеристик.ДополнительныеРеквизиты.СоздатьЭлемент();
	Объект.Наименование = ?(ПустаяСтрока(Параметры.Наименование), Параметры.Имя, Параметры.Наименование);
	Объект.Имя = Параметры.Имя;
	Объект.Набор = Набор;
	Объект.ТипЗначения = Параметры.ТипЗначения;
	Объект.Подсказка = Параметры.Подсказка;
	Объект.Обязательный = Параметры.Обязательный;
	Объект.ЭтоСведение = Параметры.ЭтоСведение;
	Объект.Порядок = Параметры.Порядок;
	Объект.Отрасль = Параметры.Отрасль;
	Для Каждого Заголовок Из Параметры.Заголовки Цикл
		Представление = Объект.Представления.Добавить();
		Представление.КодЯзыка = Заголовок.Ключ;
		Представление.Заголовок = Заголовок.Значение;
	КонецЦикла;
	Объект.Записать();

	Возврат Объект.Ссылка;

КонецФункции

// Дополнительный реквизит объекта по имени.
//
// Параметры:
//  ИмяОбъекта   - Строка - полное имя объекта метаданных
//  ИмяРеквизита - Строка - реквизит Имя элемента ПВХ
//
// Возвращаемое значение:
//  ПланВидовХарактеристикСсылка.ДополнительныеРеквизиты - пустая ссылка, если реквизита нет
//
Функция НайтиСвойство(ИмяОбъекта, ИмяРеквизита) Экспорт

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Реквизиты.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизиты КАК Реквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитов КАК Наборы
		|		ПО Реквизиты.Набор = Наборы.Ссылка
		|ГДЕ
		|	Наборы.ИмяОбъекта = &ИмяОбъекта
		|	И Реквизиты.Имя = &ИмяРеквизита
		|	И НЕ Реквизиты.ПометкаУдаления");
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизиты.ПустаяСсылка();

КонецФункции

// Набор дополнительных реквизитов объекта метаданных. Предопределённые наборы связываются
// с объектом по реквизиту ИмяОбъекта; пустой ИмяОбъекта у предопределённого набора
// заполняется здесь при первом обращении.
//
// Параметры:
//  ИмяОбъекта - Строка - полное имя объекта метаданных
//
// Возвращаемое значение:
//  СправочникСсылка.НаборыДополнительныхРеквизитов - пустая ссылка, если набора нет
//
Функция НаборПоИмениОбъекта(ИмяОбъекта) Экспорт

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Наборы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитов КАК Наборы
		|ГДЕ
		|	Наборы.ИмяОбъекта = &ИмяОбъекта
		|	И НЕ Наборы.ПометкаУдаления");
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	// Предопределённый набор нового объекта: имя элемента совпадает с именем объекта без вида.
	ИмяПредопределенного = СтрРазделить(ИмяОбъекта, ".")[СтрРазделить(ИмяОбъекта, ".").ВГраница()];
	Набор = Справочники.НаборыДополнительныхРеквизитов.ПолучитьСсылку();
	Попытка
		Набор = Справочники.НаборыДополнительныхРеквизитов[ИмяПредопределенного];
	Исключение
		Возврат Справочники.НаборыДополнительныхРеквизитов.ПустаяСсылка();
	КонецПопытки;

	НаборОбъект = Набор.ПолучитьОбъект();
	НаборОбъект.ИмяОбъекта = ИмяОбъекта;
	НаборОбъект.Записать();
	Возврат Набор;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополнительные реквизиты объекта метаданных с заголовками на языке пользователя.
//
// Параметры:
//  ИмяОбъекта - Строка - полное имя объекта метаданных
//  КодЯзыка   - Строка - код языка для заголовков и подсказок
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Свойство, Имя, Заголовок, Подсказка, ТипЗначения, Обязательный,
//                    ЭтоСведение, Многострочное, Порядок; порядок строк - порядок полей
//
Функция СвойстваОбъекта(ИмяОбъекта, КодЯзыка)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Реквизиты.Ссылка КАК Свойство,
		|	Реквизиты.Имя КАК Имя,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Представления.Заголовок, """") = """"
		|			ТОГДА Реквизиты.Наименование
		|		ИНАЧЕ Представления.Заголовок
		|	КОНЕЦ КАК Заголовок,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Представления.ПодсказкаПредставления, """") = """"
		|			ТОГДА Реквизиты.Подсказка
		|		ИНАЧЕ Представления.ПодсказкаПредставления
		|	КОНЕЦ КАК Подсказка,
		|	Реквизиты.ТипЗначения КАК ТипЗначения,
		|	Реквизиты.Обязательный КАК Обязательный,
		|	Реквизиты.ЭтоСведение КАК ЭтоСведение,
		|	Реквизиты.Многострочное КАК Многострочное,
		|	Реквизиты.Порядок КАК Порядок
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизиты КАК Реквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитов КАК Наборы
		|		ПО Реквизиты.Набор = Наборы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизиты.Представления КАК Представления
		|		ПО Представления.Ссылка = Реквизиты.Ссылка
		|			И Представления.КодЯзыка = &КодЯзыка
		|ГДЕ
		|	Наборы.ИмяОбъекта = &ИмяОбъекта
		|	И НЕ Реквизиты.ПометкаУдаления
		|	И НЕ Реквизиты.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Реквизиты.Порядок,
		|	Реквизиты.Наименование");
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("КодЯзыка", КодЯзыка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		// Набор мог быть ещё не связан с объектом (пустой ИмяОбъекта у предопределённого).
		НаборПоИмениОбъекта(ИмяОбъекта);
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Значения свойств объекта: реквизиты - из табличной части, сведения - из регистра.
//
// Параметры:
//  Объект   - ДанныеФормыСтруктура, ЛюбаяСсылка - данные формы либо ссылка на объект
//  Свойства - ТаблицаЗначений - колонки Свойство, ЭтоСведение
//
// Возвращаемое значение:
//  Соответствие - свойство -> значение; отсутствующие не включаются
//
Функция ЗначенияСвойствОбъекта(Объект, Свойства)

	Значения = Новый Соответствие;
	ЭтоДанныеФормы = ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура");
	Ссылка = Объект.Ссылка;

	ЕстьСведения = Ложь;
	Для Каждого Свойство Из Свойства Цикл
		ЕстьСведения = ЕстьСведения Или Свойство.ЭтоСведение;
	КонецЦикла;

	Если ЭтоДанныеФормы Тогда
		Для Каждого Строка Из Объект.ДополнительныеРеквизиты Цикл
			Значения.Вставить(Строка.Свойство, Строка.Значение);
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Реквизиты.Свойство КАК Свойство,
			|	Реквизиты.Значение КАК Значение
			|ИЗ
			|	&ИмяТаблицы КАК Реквизиты
			|ГДЕ
			|	Реквизиты.Ссылка = &Ссылка");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", Ссылка.Метаданные().ПолноеИмя() + ".ДополнительныеРеквизиты");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Значения.Вставить(Выборка.Свойство, Выборка.Значение);
		КонецЦикла;
	Иначе
		// Новый объект без формы: реквизитов ещё нет.
		Значения.Очистить();
	КонецЕсли;

	Если ЕстьСведения И ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Сведения.Свойство КАК Свойство,
			|	Сведения.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ДополнительныеСведения КАК Сведения
			|ГДЕ
			|	Сведения.Объект = &Объект");
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Значения.Вставить(Выборка.Свойство, Выборка.Значение);
		КонецЦикла;
	КонецЕсли;

	Возврат Значения;

КонецФункции

// Добавляет в группу формы поле под один дополнительный реквизит.
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения
//  Группа       - ГруппаФормы - родитель поля
//  ИмяРеквизита - Строка - реквизит формы с данными поля
//  Свойство     - СтрокаТаблицыЗначений - см. СвойстваОбъекта
//
Процедура ДобавитьПолеФормы(Форма, Группа, ИмяРеквизита, Свойство)

	Поле = Форма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Группа);
	Поле.ПутьКДанным = ИмяРеквизита;
	Поле.Заголовок = Свойство.Заголовок;
	Поле.Подсказка = Свойство.Подсказка;

	Если Свойство.ТипЗначения.СодержитТип(Тип("Булево")) И Свойство.ТипЗначения.Типы().Количество() = 1 Тогда
		Поле.Вид = ВидПоляФормы.ПолеФлажка;
		Возврат;
	КонецЕсли;

	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ОтметкаНезаполненного = Свойство.Обязательный;
	Поле.МногострочныйРежим = Свойство.Многострочное;
	Если Свойство.Многострочное Тогда
		Поле.Высота = 3;
	КонецЕсли;

	Если Свойство.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияДополнительныхРеквизитов")) Тогда
		// Список значений подчинён своему реквизиту: в выборе показываются только его значения.
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Свойство.Свойство));
		Поле.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	КонецЕсли;

КонецПроцедуры

Функция ФормаСДополнительнымиРеквизитами(Форма)

	Для Каждого Реквизит Из Форма.ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя = ИмяТаблицыОписаний() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

Функция ИмяТаблицыОписаний()

	Возврат "ДополнительныеРеквизитыОписание";

КонецФункции

Функция ИмяРеквизитаФормы(Номер)

	Возврат "ДополнительныйРеквизит" + Формат(Номер, "ЧГ=0");

КонецФункции

Функция КодТекущегоЯзыка()

	Возврат ТекущийЯзык().КодЯзыка;

КонецФункции

#КонецОбласти
